Enterprise_Serivces/Cert/SilverGroup1/CSLAllSparkCatalogService/result1/Iteration1/t2_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0">3408e959-5454-4a39-bbc6-ba0d62f3d82e</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/AllSparkCatalog/V1.0/DigitalCatalogService_v1/GetCatalogByAllSparkID</wsa:Action><wsa:MessageID>uuid:0b611065-7056-4890-9d22-6e0e9515718f</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslallsparkcatalogserviceqa1.testgs.pvt/DigitalCatalogService.svc</wsa:To></soap:Header><soap:Body><GetCatalogByAllSparkIDRequest xmlns="http://www.gamestop.com/CSL/AllSparkCatalog/V1.0"><AllSparkID>20140</AllSparkID><PartnerKey>TEST-US</PartnerKey></GetCatalogByAllSparkIDRequest></soap:Body></soap:Envelope>